In [1]:
import pandas as pd

employees = pd.DataFrame({
    'emp_id': [1, 1, 1, 2, 2],
    'event_day': ['2020-11-28', '2020-11-28', '2020-12-03', '2020-11-28', '2020-12-09'],
    'in_time': [4, 55, 1, 3, 47],
    'out_time': [32, 200, 42, 33, 74]
})
employees

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [21]:
employees['total_time'] = employees.out_time - employees['in_time']
df = employees.groupby(['event_day', 'emp_id'])['total_time'].sum().reset_index()
df

    event_day  emp_id  total_time
0  2020-11-28       1         173
1  2020-11-28       2          30
2  2020-12-03       1          41
3  2020-12-09       2          27

In [22]:
dt = df.rename({'event_day': 'day'}, axis=1)

dt

          day  emp_id  total_time
0  2020-11-28       1         173
1  2020-11-28       2          30
2  2020-12-03       1          41
3  2020-12-09       2          27

In [28]:
import pandas as pd
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    t = courses["class"].value_counts()
    return t[t>=5].index.to_frame()

find_classes(courses)
t = courses["class"].value_counts()
t

class
Math        6
English     1
Biology     1
Computer    1
Name: count, dtype: int64

In [47]:
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})
print(orders)
# orders.groupby('customer_number')['order_number'].nunique().idxmax()
orders['customer_number'].value_counts().idxmax()

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

3

In [43]:
max_customer_number = orders.groupby('customer_number')['order_number'].apply(lambda x: x.nunique()).idxmax()
max_customer_number

3

In [51]:
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

dt = activities.groupby('sell_date')['product']

In [53]:
activities.groupby('sell_date').apply(lambda x: print(x))

   sell_date     product
0 2020-05-30   Headphone
3 2020-05-30  Basketball
6 2020-05-30     T-Shirt
   sell_date product
1 2020-06-01  Pencil
4 2020-06-01   Bible
   sell_date product
2 2020-06-02    Mask
5 2020-06-02    Mask

/var/folders/3l/8z9btxnn0v5ggn_bn3fpsv800000gn/T/ipykernel_14903/2782832369.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  activities.groupby('sell_date').apply(lambda x: print(x))

Empty DataFrame
Columns: []
Index: []

In [52]:
df = activities.groupby('sell_date').agg(
    num_sold = ('product','nunique'),
    products = ('product',lambda x:','.join(sorted(set(x))))
).reset_index()
df

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask